sample.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroL
R.xsd"
	xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/Suministro
Informacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<sum:AltaFactuSistemaFacturacion>
			<sum1:Cabecera>
				<sum1:IDVersion>1.0</sum1:IDVersion>
				<sum1:ObligadoEmision>
					<sum1:NombreRazon>Empresa VeriFactu</sum1:NombreRazon>
					<sum1:NIF>NIF</sum1:NIF>
				</sum1:ObligadoEmision>
				<sum1:TipoRegistroAEAT>T0</sum1:TipoRegistroAEAT>
			</sum1:Cabecera>
			<sum:RegistroAltaFacturas>
				<sum:RegistroFacturacion>
					<sum1:IDFactura>
						<sum1:IDEmisorFactura>
							<sum1:NIF>NIF</sum1:NIF>
						</sum1:IDEmisorFactura>
						<sum1:NumSerieFacturaEmisor>12345</sum1:NumSerieFacturaEmisor>
						<sum1:FechaExpedicionFacturaEmisor>13-11-2023</sum1:FechaExpedicionFacturaEmisor>
					</sum1:IDFactura>
					<sum1:NombreRazonEmisor>certificado uno telematicas</sum1:NombreRazonEmisor>
					<sum1:TipoRegistroSIF>S0</sum1:TipoRegistroSIF>
					<sum1:TipoFactura>F1</sum1:TipoFactura>
					<sum1:DescripcionOperacion>Descripc</sum1:DescripcionOperacion>
					<sum1:Destinatarios>
						<sum1:IDDestinatario>
							<sum1:NombreRazon>Empresa VeriFactu</sum1:NombreRazon>
							<sum1:NIF>NIF</sum1:NIF>
						</sum1:IDDestinatario>
					</sum1:Destinatarios>
					<sum1:Desglose>
						<sum1:DetalleDesglose>
							<sum1:ClaveRegimen>01</sum1:ClaveRegimen>
							<sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
							<sum1:TipoImpositivo>4</sum1:TipoImpositivo>
							<sum1:BaseImponibleOimporteNoSujeto>10</sum1:BaseImponibleOimporteNoSujeto>
							<sum1:CuotaRepercutida>0.4</sum1:CuotaRepercutida>
						</sum1:DetalleDesglose>
						<sum1:DetalleDesglose>
							<sum1:ClaveRegimen>01</sum1:ClaveRegimen>
							<sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
							<sum1:TipoImpositivo>21</sum1:TipoImpositivo>
							<sum1:BaseImponibleOimporteNoSujeto>100</sum1:BaseImponibleOimporteNoSujeto>
							<sum1:CuotaRepercutida>21</sum1:CuotaRepercutida>
						</sum1:DetalleDesglose>
					</sum1:Desglose>
					<sum1:ImporteTotal>131.4</sum1:ImporteTotal>
					<sum1:EncadenamientoRegistroAnterior>
						<sum1:IDEmisorFacturaRegistroAnterior>
							<sum1:NIF>NIF</sum1:NIF>
						</sum1:IDEmisorFacturaRegistroAnterior>
						<sum1:NumSerieFacturaRegistroAnterior>44</sum1:NumSerieFacturaRegistroAnterior>
						<sum1:FechaExpedicionFacturaRegistroAnterior>13-02-2022</sum1:FechaExpedicionFacturaRegistroAnterior>
						<sum1:HuellaRegistroAnterior>HuellaRegistroAnterior</sum1:HuellaRegistroAnterior>
					</sum1:EncadenamientoRegistroAnterior>
					<sum1:SistemaInformatico>
						<sum1:NombreRazon>CERTIFICADO DOS TELEMATICAS</sum1:NombreRazon>
						<sum1:NIF>NIF</sum1:NIF>
						<sum1:NombreSistemaInformatico>NombreSistemaInformatico</sum1:NombreSistemaInformatico>
						<sum1:IdSistemaInformatico>77</sum1:IdSistemaInformatico>
						<sum1:Version>1.0.03</sum1:Version>
						<sum1:NumeroInstalacion>383</sum1:NumeroInstalacion>
						<sum1:TipoUsoPosibleSoloVerifactu>S</sum1:TipoUsoPosibleSoloVerifactu>
						<sum1:TipoUsoPosibleOtros>N</sum1:TipoUsoPosibleOtros>
						<sum1:TipoUsoPosibleMultiOT>N</sum1:TipoUsoPosibleMultiOT>
					</sum1:SistemaInformatico>
					<sum1:FechaGenRegistro>13-11-2023</sum1:FechaGenRegistro>
					<sum1:HoraGenRegistro>20:59:25</sum1:HoraGenRegistro>
					<sum1:HusoHorarioGenRegistro>02</sum1:HusoHorarioGenRegistro>
				</sum:RegistroFacturacion>
				<sum:DatosControl>
					<sum1:Huella>Huella</sum1:Huella>
					<sum1:TipoHash>01</sum1:TipoHash>
				</sum:DatosControl>
			</sum:RegistroAltaFacturas>
		</sum:AltaFactuSistemaFacturacion>
	</soapenv:Body>
</soapenv:Envelope>